SEASON = ["봄", "여름", "가을", "겨울"]

# VALIDATION_CATEGORY 사용
ITEM_CATEGORIES = [
    "데님 팬츠", "슈트 팬츠&슬랙스", "니트&스웨터 - 긴소매", "겨울 더블 코트",
    "피케&카라 티셔츠 - 반소매", "긴소매 티셔츠", "로퍼", "패딩 베스트",
    "환절기 코트", "나일론&코치 재킷", "셔츠&블라우스 - 반소매", "플리스&뽀글이",
    "더비 슈즈", "슈트&블레이저 재킷", "사파리&헌팅 재킷", "패션스니커즈화",
    "겨울 기타 코트", "블루종&MA-1", "앵클/숏 부츠", "후드 티셔츠",
    "스트레이트 팁", "니트&스웨터 - 반소매", "워커", "롱패딩&헤비 아우터",
    "트레이닝 재킷", "반소매 티셔츠", "셔츠&블라우스 - 긴소매", "스포츠/캐주얼 샌들",
    "모카신", "트레이닝&조거 팬츠", "쪼리/플립플랍", "트러커 재킷",
    "피케&카라 티셔츠 - 긴소매", "코튼 팬츠", "무스탕&퍼", "후드 집업",
    "스타디움 재킷", "미들/하프 부츠", "겨울 싱글 코트", "캔버스/단화",
    "맨투맨&스웨트", "숏패딩&헤비 아우터", "카디건", "아노락 재킷", "숏팬츠"
]

SHOES_CATEGORIES = {
    "캔버스/단화",
    "패션스니커즈화",
    "앵클/숏 부츠",
    "미들/하프 부츠",
    "워커",
    "더비 슈즈",
    "스트레이트 팁",
    "로퍼",
    "모카신",
    "쪼리/플립플랍",
    "스포츠/캐주얼 샌들"
}

COLOR_PALETTE_BY_SEASON = {
    "봄": ['오트밀', '아이보리', '화이트', '블랙', '베이지', '네이비', "흑청", "진청", "연청", "중청"],
    "여름": ['스카이블루', '네이비', '화이트', '블랙', "연청", "중청", "흑청"],
    "가을": ['화이트', '블랙', '버건디', '오트밀', '아이보리', '카키', '베이지', '브라운', "흑청", "진청", "중청"],
    "겨울": ['화이트', '그레이', '블랙', '네이비', '카키', "흑청", "진청", "중청"]
}